# RemoveControl Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemporaryGraphicsManager..::..RemoveControl Method
TemporaryGraphicsManager Class See Also
---
Deletes the existing control identified by the unique index.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public void RemoveControl(
	int index
)
```

Visual Basic
---
```text
Public Sub RemoveControl ( _
	index As Integer _
)
```

Visual C++
---
```text
public:
void RemoveControl(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 Unique index of the control to be deleted.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | index is out of range of TemporaryGraphicsManager managed objects, or the indexed object has been removed from the document. |

# See Also
TemporaryGraphicsManager Class
Autodesk.Revit.DB Namespace